In [1]:
import pandas as pd

In [2]:
pd.DataFrame({"Name":["Rithik","Mukul","Kunal"],"Age":[25,25,26],"Place":["Hamirpur","Shimla","Delhi"]})

     Name  Age     Place
0  Rithik   25  Hamirpur
1   Mukul   25    Shimla
2   Kunal   26     Delhi

In [3]:
pd.DataFrame({"Name":["Rithik","Mukul","Kunal"],"Age":[25,25,26],"Place":["Hamirpur","Shimla","Delhi"]},index=["User1","User2","User3"])

         Name  Age     Place
User1  Rithik   25  Hamirpur
User2   Mukul   25    Shimla
User3   Kunal   26     Delhi

In [4]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
userlist = pd.DataFrame({"Name":["Rithik","Mukul","Kunal"],"Age":[25,25,26],"Place":["Hamirpur","Shimla","Delhi"]},index=["User1","User2","User3"])

In [6]:
userlist

         Name  Age     Place
User1  Rithik   25  Hamirpur
User2   Mukul   25    Shimla
User3   Kunal   26     Delhi

In [7]:
userlist.Name

User1    Rithik
User2     Mukul
User3     Kunal
Name: Name, dtype: object

In [8]:
userlist.to_csv("list_of_users.csv")

In [9]:
reading_csv = pd.read_csv("list_of_users.csv",index_col=0)

In [10]:
reading_csv

         Name  Age     Place
User1  Rithik   25  Hamirpur
User2   Mukul   25    Shimla
User3   Kunal   26     Delhi

In [11]:
reading_csv.shape

(3, 3)

In [12]:
reading_csv.head()

         Name  Age     Place
User1  Rithik   25  Hamirpur
User2   Mukul   25    Shimla
User3   Kunal   26     Delhi

In [13]:
reading_csv.Age

User1    25
User2    25
User3    26
Name: Age, dtype: int64

In [14]:
reading_csv.Place

User1    Hamirpur
User2      Shimla
User3       Delhi
Name: Place, dtype: object

In [15]:
reading_csv["Place"]

User1    Hamirpur
User2      Shimla
User3       Delhi
Name: Place, dtype: object

In [16]:
reading_csv["Place"][2]

C:\Users\jaswa\AppData\Local\Temp\ipykernel_41520\4217210329.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  reading_csv["Place"][2]

'Delhi'

In [17]:
reading_csv.iloc[0]

Name       Rithik
Age            25
Place    Hamirpur
Name: User1, dtype: object

In [18]:
reading_csv.iloc[0,2]

'Hamirpur'

In [19]:
reading_csv.iloc[:,2]

User1    Hamirpur
User2      Shimla
User3       Delhi
Name: Place, dtype: object

In [20]:
reading_csv.iloc[1:2,2]

User2    Shimla
Name: Place, dtype: object

In [21]:
reading_csv.iloc[-1]

Name     Kunal
Age         26
Place    Delhi
Name: User3, dtype: object

In [22]:
reading_csv.loc["User2"]

Name      Mukul
Age          25
Place    Shimla
Name: User2, dtype: object

In [23]:
reading_csv.loc[:,"Place"]

User1    Hamirpur
User2      Shimla
User3       Delhi
Name: Place, dtype: object

In [24]:
reading_csv.loc["User1","Place"]

'Hamirpur'

In [25]:
reading_csv.loc["User1",["Age","Place"]]

Age            25
Place    Hamirpur
Name: User1, dtype: object

In [26]:
reading_csv.Age == 25

User1     True
User2     True
User3    False
Name: Age, dtype: bool

In [27]:
reading_csv.loc[reading_csv.Age == 25]

         Name  Age     Place
User1  Rithik   25  Hamirpur
User2   Mukul   25    Shimla

In [28]:
reading_csv.loc[(reading_csv.Age == 25) | (reading_csv.Name == "Kunal") ]

         Name  Age     Place
User1  Rithik   25  Hamirpur
User2   Mukul   25    Shimla
User3   Kunal   26     Delhi

In [29]:
reading_csv.loc[(reading_csv.Age == 25) & (reading_csv.Name == "Rithik") ]

         Name  Age     Place
User1  Rithik   25  Hamirpur

In [30]:
reading_csv.loc[reading_csv.Place.isin(["Hamirpur","Shimla"])]

         Name  Age     Place
User1  Rithik   25  Hamirpur
User2   Mukul   25    Shimla

In [31]:
reading_csv["county"] = "India"

In [32]:
reading_csv

         Name  Age     Place county
User1  Rithik   25  Hamirpur  India
User2   Mukul   25    Shimla  India
User3   Kunal   26     Delhi  India

In [33]:
reading_csv["Serial Number"] = range(1,4)

In [34]:
reading_csv

         Name  Age     Place county  Serial Number
User1  Rithik   25  Hamirpur  India              1
User2   Mukul   25    Shimla  India              2
User3   Kunal   26     Delhi  India              3

In [35]:
reading_csv.set_index("Serial Number")

                 Name  Age     Place county
Serial Number
1              Rithik   25  Hamirpur  India
2               Mukul   25    Shimla  India
3               Kunal   26     Delhi  India

In [36]:
reading_csv.describe()

             Age  Serial Number
count   3.000000            3.0
mean   25.333333            2.0
std     0.577350            1.0
min    25.000000            1.0
25%    25.000000            1.5
50%    25.000000            2.0
75%    25.500000            2.5
max    26.000000            3.0

In [37]:
reading_csv.Place.describe()

count            3
unique           3
top       Hamirpur
freq             1
Name: Place, dtype: object

In [38]:
reading_csv.Age.median()

25.0

In [39]:
reading_csv.Place.unique()

array(['Hamirpur', 'Shimla', 'Delhi'], dtype=object)

In [40]:
reading_csv.Place.value_counts()

Place
Hamirpur    1
Shimla      1
Delhi       1
Name: count, dtype: int64

In [41]:
current_year = 2025
reading_csv["BirthYear"] = 1

In [42]:
reading_csv

         Name  Age     Place county  Serial Number  BirthYear
User1  Rithik   25  Hamirpur  India              1          1
User2   Mukul   25    Shimla  India              2          1
User3   Kunal   26     Delhi  India              3          1

In [43]:
reading_csv["BirthYear"].map(lambda p: current_year - reading_csv.Age)

User1    User1    2000
User2    2000
User3    1999
Name...
User2    User1    2000
User2    2000
User3    1999
Name...
User3    User1    2000
User2    2000
User3    1999
Name...
Name: BirthYear, dtype: object

In [44]:
reading_csv

         Name  Age     Place county  Serial Number  BirthYear
User1  Rithik   25  Hamirpur  India              1          1
User2   Mukul   25    Shimla  India              2          1
User3   Kunal   26     Delhi  India              3          1

In [45]:
birth_year = reading_csv["BirthYear"].map(lambda p: current_year - reading_csv.Age)

In [46]:
birth_year

User1    User1    2000
User2    2000
User3    1999
Name...
User2    User1    2000
User2    2000
User3    1999
Name...
User3    User1    2000
User2    2000
User3    1999
Name...
Name: BirthYear, dtype: object

In [47]:
reading_csv["BirthYear"] = birth_year

In [48]:
reading_csv

,Name,Age,Place,county,Serial Number,BirthYear
User1,Rithik,25,Hamirpur,India,1,User1 2000 User2 2000 User3 1999 Name...
User2,Mukul,25,Shimla,India,2,User1 2000 User2 2000 User3 1999 Name...
User3,Kunal,26,Delhi,India,3,User1 2000 User2 2000 User3 1999 Name...

In [49]:
reading_csv["BirthYear"] = reading_csv["BirthYear"].map(lambda p: current_year - reading_csv.Age)

In [50]:
reading_csv

,Name,Age,Place,county,Serial Number,BirthYear
User1,Rithik,25,Hamirpur,India,1,User1 2000 User2 2000 User3 1999 Name...
User2,Mukul,25,Shimla,India,2,User1 2000 User2 2000 User3 1999 Name...
User3,Kunal,26,Delhi,India,3,User1 2000 User2 2000 User3 1999 Name...

In [51]:
reading_csv.Age.map(lambda p: 2025 - p)

User1    2000
User2    2000
User3    1999
Name: Age, dtype: int64

In [52]:
reading_csv

,Name,Age,Place,county,Serial Number,BirthYear
User1,Rithik,25,Hamirpur,India,1,User1 2000 User2 2000 User3 1999 Name...
User2,Mukul,25,Shimla,India,2,User1 2000 User2 2000 User3 1999 Name...
User3,Kunal,26,Delhi,India,3,User1 2000 User2 2000 User3 1999 Name...

In [53]:
reading_csv["BirthYear"] = 0

In [54]:
reading_csv

         Name  Age     Place county  Serial Number  BirthYear
User1  Rithik   25  Hamirpur  India              1          0
User2   Mukul   25    Shimla  India              2          0
User3   Kunal   26     Delhi  India              3          0

In [55]:
reading_csv["BirthYear"] = reading_csv["BirthYear"].map(lambda p: 2025 - p)

In [56]:
reading_csv

         Name  Age     Place county  Serial Number  BirthYear
User1  Rithik   25  Hamirpur  India              1       2025
User2   Mukul   25    Shimla  India              2       2025
User3   Kunal   26     Delhi  India              3       2025

In [57]:
reading_csv["BirthYear"] = reading_csv.Age

In [58]:
reading_csv

         Name  Age     Place county  Serial Number  BirthYear
User1  Rithik   25  Hamirpur  India              1         25
User2   Mukul   25    Shimla  India              2         25
User3   Kunal   26     Delhi  India              3         26

In [59]:
reading_csv["BirthYear"] = reading_csv["BirthYear"].map(lambda p: 2025 - p)

In [60]:
reading_csv

         Name  Age     Place county  Serial Number  BirthYear
User1  Rithik   25  Hamirpur  India              1       2000
User2   Mukul   25    Shimla  India              2       2000
User3   Kunal   26     Delhi  India              3       1999

In [61]:
def row_function(row):
    if row.Place == "Hamirpur" or row.Place == "Shimla":
        return "Himachal Pradesh"
    else:
        return "NCT"

In [62]:
reading_csv["State"] = ""

In [63]:
reading_csv

         Name  Age     Place county  Serial Number  BirthYear State
User1  Rithik   25  Hamirpur  India              1       2000
User2   Mukul   25    Shimla  India              2       2000
User3   Kunal   26     Delhi  India              3       1999

In [64]:
reading_csv["State"] = reading_csv.apply(row_function,axis="columns")

In [65]:
print("Hello")

Hello

In [66]:
reading_csv

,Name,Age,Place,county,Serial Number,BirthYear,State
User1,Rithik,25,Hamirpur,India,1,2000,Himachal Pradesh
User2,Mukul,25,Shimla,India,2,2000,Himachal Pradesh
User3,Kunal,26,Delhi,India,3,1999,NCT

In [69]:
reading_csv.Age.value_counts()

Age
25    2
26    1
Name: count, dtype: int64

In [70]:
reading_csv.groupby("Age")

In [71]:
reading_csv

,Name,Age,Place,county,Serial Number,BirthYear,State
User1,Rithik,25,Hamirpur,India,1,2000,Himachal Pradesh
User2,Mukul,25,Shimla,India,2,2000,Himachal Pradesh
User3,Kunal,26,Delhi,India,3,1999,NCT

In [72]:
groupedvalue = reading_csv.groupby("Age")

In [73]:
groupedvalue

In [74]:
print(groupedvalue)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001FD7EDF1090>

In [77]:
reading_csv.groupby("Age").Age.count()

Age
25    2
26    1
Name: Age, dtype: int64

In [78]:
reading_csv.groupby("Age").BirthYear.min()

Age
25    2000
26    1999
Name: BirthYear, dtype: int64